{
    "entry_point": "jobshop_problem:JobShopProblem",
    "default_params": {
      "instance_file": "instances/ft06.txt"
    },
    "creator": "Rastion",
    "type": "problem",
    "problem_name": "Job shop scheduling problem",
    "description": "A set of jobs must be processed on every machine of the shop. Each job consists of an ordered sequence of tasks (activities), one per machine. For each job, a processing order (a permutation of machines) is specified, and each task has a given processing time. In addition to precedence constraints (a job’s tasks must follow its specified order), disjunctive resource constraints ensure that each machine processes only one task at a time. The goal is to find, for each machine, a sequence of jobs that minimizes the makespan (the time when all jobs have been completed).",
    "link_to_dataset": "https://github.com/Rastion/jobshop_problem/blob/main/instances/ft06.txt",
    "keywords": [
      "job shop",
      "product-scheduling",
      "Taillard",
      "makespan"
    ],
    "data_format": {
      "instance_file": {
        "format": "A text file in the Taillard format. The first line contains header information. The second line contains five numbers: number of jobs, number of machines, seed, upper bound, and lower bound. The next nb_jobs lines list the processing times for each job (given in processing order). The following nb_jobs lines list the processing order for each job (an ordered list of visited machines, given as 1-indexed values)."
      }
    },
    "decision_variables": {
      "jobs_order": {
        "type": "list of lists of int",
        "description": "A list (of length nb_machines) where each element is a permutation of job indices (0-indexed) representing the sequence in which jobs are processed on that machine."
      }
    },
    "objective": {
      "type": "minimization",
      "function": "Makespan = max_{j in jobs} (finish time of the last activity of job j)",
      "description": "Minimize the makespan, defined as the maximum completion time over all jobs (each job’s completion time is that of its last activity in its specified processing order)."
    },
    "solution_representation": "A dictionary with key 'jobs_order' mapping to a list of job sequences (one per machine).",
    "formulations": [
      ""
    ]
  }
  